RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_lptimer.c
/***************************************************************************//**
* \file cyhal_lptimer.c
*
* \brief
* Provides a high level interface for interacting with the Infineon Low-Power Timer.
* This interface abstracts out the chip specific details. If any chip specific
* functionality is necessary, or performance is critical the low level functions
* can be used directly.
*
********************************************************************************
* \copyright
* Copyright 2018-2021 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_hal_impl_lptimer LPTimer (Low-Power Timer)
* \ingroup group_hal_impl
* \{
* The maximum number of ticks that can set to an LPTimer is 0xFFF0FFFF for non CAT1C devices.
* It is not recommended to use 0xFFFFFFFF. This is to avoid overflowing both C0 and C1.
* For CAT1C devices (XMC), the maximum number of ticks that can be set to an LPTimer is 0xFFFFFFFF
* since C0 and C1 do not cascade.
*
* \section section_cat1c_lptimer_set_match LPTimer Set Match
* For CAT1C devices (XMC), \ref cyhal_lptimer_set_match will only trigger a single interrupt.
*
* \} group_hal_impl_lptimer
*/

#include "cmsis_compiler.h"
#include "cy_syslib.h"
#include "cy_sysint.h"
#include "cyhal_lptimer.h"
#include "cyhal_hwmgr.h"
#include "cyhal_system_impl.h"
#include "cyhal_utils.h"
#include "cyhal_irq_psoc.h"
#include "cyhal_clock.h"

#if (CYHAL_DRIVER_AVAILABLE_LPTIMER)

#if defined(CY_IP_MXS40SRSS) || defined(CY_IP_MXS40SSRSS) || defined(CY_IP_MXS28SRSS)
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
#include "cy_mcwdt_b.h"
#else
#include "cy_mcwdt.h"
#endif
#elif defined (CY_IP_M0S8WCO)
#include "cy_wdc.h"
#define Cy_MCWDT_Init               Cy_WDC_Init
#define Cy_MCWDT_DeInit             Cy_WDC_DeInit
#define Cy_MCWDT_Enable             Cy_WDC_Enable
#define Cy_MCWDT_Disable            Cy_WDC_Disable
#define Cy_MCWDT_ClearInterrupt     Cy_WDC_ClearInterrupt
#define Cy_MCWDT_GetCount           Cy_WDC_GetCount
#define Cy_MCWDT_SetMatch           Cy_WDC_SetMatch
#define Cy_MCWDT_GetMatch           Cy_WDC_GetMatch
#define Cy_MCWDT_ResetCounters      Cy_WDC_ResetCounters
#define Cy_MCWDT_GetEnabledStatus   Cy_WDC_GetEnabledStatus
#define CY_MCWDT_COUNTER0           CY_WDC_COUNTER0
#define CY_MCWDT_COUNTER1           CY_WDC_COUNTER1
#define CY_MCWDT_COUNTER2           CY_WDC_COUNTER2
#define CY_MCWDT_CTR0               CY_WDC_COUNTER0_Msk
#define CY_MCWDT_CTR1               CY_WDC_COUNTER1_Msk
#define CY_MCWDT_CTR2               CY_WDC_COUNTER2_Msk
#define srss_interrupt_mcwdt_0_IRQn wco_interrupt_IRQn
#else
#error "Current HW block is not supported"
#endif

#if defined(__cplusplus)
extern "C" {
#endif

#if (defined(CY_IP_MXS40SRSS_INSTANCES) || defined(CY_IP_MXS40SSRSS_INSTANCES) || defined(CY_IP_MXS28SRSS_INSTANCES))
#define _CYHAL_LPTIMER_INSTANCES    SRSS_NUM_MCWDT
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
static MCWDT_Type * const _CYHAL_LPTIMER_BASE_ADDRESSES[] = {
#if SRSS_NUM_MCWDT >= 1
    MCWDT0,
#endif
#if SRSS_NUM_MCWDT >= 2
    MCWDT1,
#endif
#if SRSS_NUM_MCWDT >= 3
    MCWDT2,
#endif
#else
static MCWDT_STRUCT_Type * const _CYHAL_LPTIMER_BASE_ADDRESSES[] = {
#if SRSS_NUM_MCWDT >= 1
    MCWDT_STRUCT0,
#endif
#if SRSS_NUM_MCWDT >= 2
    MCWDT_STRUCT1,
#endif
#if SRSS_NUM_MCWDT >= 3
#error "SRSS_NUM_MCWDT > 2 not supported"
#endif
#endif
};
#elif defined (CY_IP_M0S8WCO_INSTANCES)
static WCO_Type * const _CYHAL_LPTIMER_BASE_ADDRESSES[] = {
#if CY_IP_M0S8WCO_INSTANCES >= 1
    WCO,
#endif
#if CY_IP_M0S8WCO_INSTANCES >= 2
#error "CY_IP_M0S8WCO_INSTANCES > 1 not supported"
#endif
};
#else
#error "Current HW block is not supported"
#endif

#define _CYHAL_LPTIMER_CTRL               (CY_MCWDT_CTR0 | CY_MCWDT_CTR1 | CY_MCWDT_CTR2)
#define _CYHAL_LPTIMER_MIN_DELAY          (3U) /* minimum amount of lfclk cycles of that LPTIMER can delay for. */
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
// The max sleep time for CAT1C devices is ~17.5 hours. This is because the toggle bit that is set for Counter2
// match value toggles every time the bit changes from 0 to 1 or from 1 to 0.
#define _CYHAL_LPTIMER_MAX_DELAY_TICKS    (0xffffffffUL) /* ~36hours, set to 0xffffffff since C0 and C1 do not cascade */
#else
#define _CYHAL_LPTIMER_MAX_DELAY_TICKS    (0xfff0ffffUL) /* ~36hours, Not set to 0xffffffff to avoid C0 and C1 both overflowing */
#endif
#define _CYHAL_LPTIMER_MAX_COUNTER_VAL    (0xffffffffUL) /* Maximum value of the counter before it rolls over */

#define _CYHAL_LPTIMER_DEFAULT_PRIORITY   (3U)

#if defined(CY_IP_MXS40SRSS) || defined(CY_IP_MXS40SSRSS) || defined(CY_IP_MXS28SRSS)
static cyhal_lptimer_t *_cyhal_lptimer_config_structs[SRSS_NUM_MCWDT];
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
static const uint16_t _CYHAL_LPTIMER_RESET_TIME_US = 93;
static const uint16_t _CYHAL_LPTIMER_SETMATCH_TIME_US = 93;
static const cy_stc_mcwdt_b_config_t default_cfg = {
                .c0UpperLimit = 0xFFFF,
                .c0WarnLimit =  0xFFFF,
                .c0WarnAction = CY_MCWDT_WARN_ACTION_NONE,
                .c0UpperAction = CY_MCWDT_ACTION_NONE,
                .c0DebugRun = CY_MCWDT_ENABLE,
                .c1UpperLimit = 0xFFFF,
                .c1UpperAction = CY_MCWDT_ACTION_NONE,
                .c1DebugRun = CY_MCWDT_ENABLE,
                .c1WarnLimit =  0xFFFF,
                .c1WarnAction = CY_MCWDT_WARN_ACTION_INT,
                .c1AutoService = CY_MCWDT_ENABLE,
                .c2ToggleBit = CY_MCWDT_CNT2_MONITORED_BIT0,
                .c2Action = CY_MCWDT_CNT2_ACTION_INT,
                .coreSelect = CY_MCWDT_PAUSED_BY_NO_CORE,
        };
#else
#if defined(CY_IP_MXS40SSRSS)
static const uint16_t _CYHAL_LPTIMER_RESET_TIME_US = 93; // Recommended value per PDL
#else
static const uint16_t _CYHAL_LPTIMER_RESET_TIME_US = 62;
#endif
static const uint16_t _CYHAL_LPTIMER_SETMATCH_TIME_US = 0;
static const cy_stc_mcwdt_config_t default_cfg = {
                .c0Match = 0xFFFF,
                .c1Match = 0xFFFF,
                .c0Mode = CY_MCWDT_MODE_INT,
                .c1Mode = CY_MCWDT_MODE_INT,
                .c2Mode = CY_MCWDT_MODE_NONE,
                .c2ToggleBit = 0,
                .c0ClearOnMatch = false,
                .c1ClearOnMatch = false,
                .c0c1Cascade = true,
                .c1c2Cascade = false
        };
#endif
#elif defined (CY_IP_M0S8WCO)
static cyhal_lptimer_t *_cyhal_lptimer_config_structs[CY_IP_M0S8WCO_INSTANCES];
static const uint16_t _CYHAL_LPTIMER_RESET_TIME_US = 180;
static const uint16_t _CYHAL_LPTIMER_SETMATCH_TIME_US = 180;
static const cy_stc_wdc_config_t default_cfg = {
                .counter0Match = 0xFFFF,
                .counter1Match = 0xFFFF,
                .counter2ToggleBit = 0,
                .counter0Interrupt = false,
                .counter1Interrupt = true,
                .counter2Interrupt = false,
                .counter0ClearOnMatch = false,
                .counter1ClearOnMatch = true,
                .countersCascade = CY_WDC_CASCADE_COUNTERS01,
                .clockSource = CY_WDC_CLOCK_ILO
        };
#else
#error "Current HW block is not supported"
#endif

static void _cyhal_lptimer_irq_handler(void)
{
    uint32_t instance = (uint32_t)_cyhal_irq_get_active() - (uint32_t) srss_interrupt_mcwdt_0_IRQn;
    cyhal_lptimer_t *obj = _cyhal_lptimer_config_structs[instance];
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
    uint32_t c2_count = Cy_MCWDT_GetCount(obj->base, CY_MCWDT_CTR2);
    //Since CAT1C does not use Counter0, there is no need to clear the interrupt
    Cy_MCWDT_ClearInterrupt(obj->base, (CY_MCWDT_CTR1 | CY_MCWDT_CTR2));
#else
    Cy_MCWDT_ClearInterrupt(obj->base, (CY_MCWDT_CTR0 | CY_MCWDT_CTR1 | CY_MCWDT_CTR2));
#endif
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
    // We want to clear the interrupt mask everytime we enter the IRQ handler
    // for CAT1C devices regardless if set_delay or set_match was called.
    // This means if cyhal_lptimer_set_match was called, a single interrupt will be triggered.
    Cy_MCWDT_ClearInterruptMask(obj->base, obj->counter);
#endif
    /* Clear interrupt mask if set only from cyhal_lptimer_set_delay() function */
    if (obj->clear_int_mask)
    {
#if defined(CY_IP_MXS40SRSS) || defined(CY_IP_MXS40SSRSS) || defined(CY_IP_MXS28SRSS)
        Cy_MCWDT_SetInterruptMask(obj->base, 0);
#else
        Cy_WDC_InterruptDisable(obj->base, CY_WDC_COUNTER1);
#endif
    }
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
    if(obj->final_time - c2_count > 0 && obj->final_time > c2_count)
    {
        cyhal_lptimer_set_delay(obj, obj->final_time - c2_count);
    }
    else
#endif
    {
        if (NULL != obj->callback_data.callback && obj->isr_call_user_cb)
        {
            cyhal_lptimer_event_callback_t callback = (cyhal_lptimer_event_callback_t) obj->callback_data.callback;
            (callback)(obj->callback_data.callback_arg, CYHAL_LPTIMER_COMPARE_MATCH);
        }
    }
}
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
uint32_t _cyhal_lptimer_get_toggle_bit(uint32_t c2_current, uint32_t delay)
{
    uint32_t val = c2_current ^ (c2_current + delay);
    int bit = 0;
    while (val > 0)
    {
        bit++;
        val >>= 1;
    }
    return bit - 1;
}
static uint32_t _cyhal_lptimer_set_delay_common(cyhal_lptimer_t *obj, uint32_t delay)
{
    // Check to see if Counter1 or Counter2 is enabled.
    // If neither is enabled, return Error Disabled.
    // We do not check to see if Counter0 is enabled as it is not used
    // for this IP implementation.
    if ((Cy_MCWDT_GetEnabledStatus(obj->base, CY_MCWDT_CTR1) == 0UL)
        || (Cy_MCWDT_GetEnabledStatus(obj->base, CY_MCWDT_CTR2) == 0UL))
    {
        return CYHAL_LPTIMER_RSLT_ERR_DISABLED;
    }
    if (delay <= _CYHAL_LPTIMER_MIN_DELAY)
    {
        delay = _CYHAL_LPTIMER_MIN_DELAY;
    }
    if (delay > _CYHAL_LPTIMER_MAX_DELAY_TICKS)
    {
        delay = _CYHAL_LPTIMER_MAX_DELAY_TICKS;
    }
    // If the delay is greater than 2^16 we will use Counter2 for interrupts
    // we must then clear the Counter2 interrupt before setting the new match.
    obj->counter = (delay > ((1 << 16)-1)) ? CY_MCWDT_CTR2 : CY_MCWDT_CTR1;
    uint32_t critical_section = cyhal_system_critical_section_enter();
    uint32_t counter_value = Cy_MCWDT_GetCount(obj->base, obj->counter);
    // if the counter value + the delay exceeds 32 bits, it is expected
    // that the wrap around will be handled by the uin32_t variable
    uint32_t match_value = counter_value + delay;
    Cy_MCWDT_Unlock(obj->base);
    if(obj->counter == CY_MCWDT_CTR1)
    {
        if(match_value > ((1 << 16)-1))
        {
            // Wait 3 LFClk cycles for reset
            Cy_MCWDT_ResetCounters(obj->base, obj->counter, _CYHAL_LPTIMER_RESET_TIME_US);
            // Since we waited 3 LFClk cycles to reset the counter, we want to deduct that from our delay
            match_value = delay - _CYHAL_LPTIMER_MIN_DELAY;
            if(match_value < _CYHAL_LPTIMER_MIN_DELAY)
            {
                // After resetting the counter and deducting the number of clock cycles it took
                // The delay is below our minumum delay.
                Cy_MCWDT_Lock(obj->base);
                cyhal_system_critical_section_exit(critical_section);
                return CYHAL_LPTIMER_RSLT_ERR_BAD_ARGUMENT;
            }
        }
        Cy_MCWDT_SetWarnLimit(obj->base, obj->counter, (uint16_t)match_value, _CYHAL_LPTIMER_SETMATCH_TIME_US);
    }
    else
    {
        // We want to get the monitored bit to set for the toggle point
        uint32_t toggle_bit = _cyhal_lptimer_get_toggle_bit(counter_value, delay);
        // We want to set an interrupt for Counter2 to the 2^n value closest to the match value without going over
        // If there is a delta between our power of value of 2^n and the match value
        // We set the remaining delay time on the object which will trigger a follow up interrupt
        // In the IRQ handler
        Cy_MCWDT_SetToggleBit(obj->base, toggle_bit);
        // Wait 3 LFClk cycles to make sure the toggle bit was updated
        cyhal_system_delay_us(_CYHAL_LPTIMER_SETMATCH_TIME_US);
    }
    Cy_MCWDT_Lock(obj->base);
    cyhal_system_critical_section_exit(critical_section);
    Cy_MCWDT_ClearInterrupt(obj->base, obj->counter);
    Cy_MCWDT_SetInterruptMask(obj->base, obj->counter);
    return CY_RSLT_SUCCESS;
}
#else
static uint32_t _cyhal_lptimer_set_delay_common(cyhal_lptimer_t *obj, uint32_t delay)
{
    if ((Cy_MCWDT_GetEnabledStatus(obj->base, CY_MCWDT_COUNTER0) == 0UL)
        || (Cy_MCWDT_GetEnabledStatus(obj->base, CY_MCWDT_COUNTER1) == 0UL)
        || (Cy_MCWDT_GetEnabledStatus(obj->base, CY_MCWDT_COUNTER2) == 0UL))
    {
        return CYHAL_LPTIMER_RSLT_ERR_DISABLED;
    }

    /**
     * - 16 bit Counter0 (C0) & Counter1 (C1) are cascaded to generated a 32 bit counter.
     * - Counter2 (C2) is a free running counter.
     * - C0 continues counting after reaching its match value. On PSoC™ 4 Counter1 is reset on
     * match. On PSoC™ 6 it continues counting.
     * - An interrupt is generated when C1 reaches the match value. On PSoC™ 4 this happens when
     * the counter increments to the same value as match. On PSoC™ 6 this happens when it increments
     * past the match value.
     *
     * EXAMPLE:
     * Supposed T=C0=C1=0, and we need to trigger an interrupt at T=0x18000.
     * We set C0_match to 0x8000 and C1 match to 2 on PSoC™ 4 and 1 on PSoC™ 6.
     * At T = 0x8000, C0_value matches C0_match so C1 get incremented. C1/C0=0x18000.
     * At T = 0x18000, C0_value matches C0_match again so C1 get incremented from 1 to 2.
     * When C1 get incremented from 1 to 2 the interrupt is generated.
     * At T = 0x18000, C1/C0 = 0x28000.
     */

    if (delay <= _CYHAL_LPTIMER_MIN_DELAY)
    {
        delay = _CYHAL_LPTIMER_MIN_DELAY;
    }
    if (delay > _CYHAL_LPTIMER_MAX_DELAY_TICKS)
    {
        delay = _CYHAL_LPTIMER_MAX_DELAY_TICKS;
    }

    Cy_MCWDT_ClearInterrupt(obj->base, CY_MCWDT_CTR1);
    uint16_t c0_old_match = (uint16_t)Cy_MCWDT_GetMatch(obj->base, CY_MCWDT_COUNTER0);

    uint32_t critical_section = cyhal_system_critical_section_enter();

