RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_lptimer.c
    /* Cascading from C0 match into C1 is queued and can take 1 full LF clk cycle.
     * There are 3 cases:
     * Case 1: if c0 = match0 then the cascade into C1 will happen 1 cycle from now. The value c1_current_ticks is 1 lower than expected.
     * Case 2: if c0 = match0 -1 then cascade may or not happen before new match value would occur. Match occurs on rising clock edge.
     *          Synchronizing match value occurs on falling edge. Wait until c0 = match0 to ensure cascade occurs.
     * Case 3: everything works as expected.
     *
     * Note: timeout is needed here just in case the LFCLK source gives out. This avoids device lockup.
     *
     * ((2 * Cycles_LFClk) / Cycles_cpu_iteration) * (HFCLk_max / LFClk_min) = Iterations_required
     * Typical case: (2 / 100) * ((150x10^6)/33576) = 89 iterations
     * Worst case: (2 / 100) * ((150x10^6)/1) = 3x10^6 iterations
     * Compromise: (2 / 100) * ((150x10^6)/0xFFFF iterations) = 45 Hz = LFClk_min
     */
    const uint32_t DEFAULT_TIMEOUT = 0xFFFFUL;
    uint32_t timeout = DEFAULT_TIMEOUT;
    uint16_t c0_current_ticks = (uint16_t)Cy_MCWDT_GetCount(obj->base, CY_MCWDT_COUNTER0);
    // Wait until the cascade has definitively happened. It takes a clock cycle for the cascade to happen, and potentially another a full
    // LFCLK clock cycle for the cascade to propagate up to the HFCLK-domain registers that the CPU reads.
    while (((((uint16_t)(c0_old_match - 1)) == c0_current_ticks) ||
                        (c0_old_match       == c0_current_ticks) ||
            (((uint16_t)(c0_old_match + 1)) == c0_current_ticks)) && (timeout != 0UL))
    {
        c0_current_ticks = (uint16_t)Cy_MCWDT_GetCount(obj->base, CY_MCWDT_COUNTER0);
        timeout--;
    }
    if (timeout == 0UL)
    {
        // Timeout has occurred. There could have been a clock failure while waiting for the count value to update.
        cyhal_system_critical_section_exit(critical_section);
        return CYHAL_LPTIMER_RSLT_ERR_DISABLED;
    }

    uint16_t c0_match = (uint16_t)(c0_current_ticks + delay);
    // Changes can take up to 2 clk_lf cycles to propagate. If we set the match within this window of the current value,
    // then it is nondeterministic whether the first cascade will trigger immediately or after 2^16 cycles. Wait until
    // c0 is in a more predictable state.
    timeout = DEFAULT_TIMEOUT;
    uint32_t c0_new_ticks = c0_current_ticks;
    while(((c0_new_ticks == c0_match) ||
          (c0_new_ticks == ((uint16_t)(c0_match + 1))) ||
          (c0_new_ticks == ((uint16_t)(c0_match + 2))))
        && (timeout != 0UL))
    {
        c0_new_ticks = (uint16_t)Cy_MCWDT_GetCount(obj->base, CY_MCWDT_COUNTER0);
        timeout--;
    }

    delay -= (c0_new_ticks >= c0_current_ticks)
        ? (c0_new_ticks - c0_current_ticks)
        : ((0xFFFFU - c0_current_ticks) + c0_new_ticks);

    c0_match = (uint16_t)(c0_current_ticks + delay);
    uint16_t c1_current_ticks = (uint16_t)Cy_MCWDT_GetCount(obj->base, CY_MCWDT_COUNTER1);
    uint16_t c1_match = (uint16_t)(c1_current_ticks + (delay >> 16));

#if defined(CY_IP_M0S8WCO)
    c1_match += 1;
    // Increase away from rollover glitch; can't go backward or c1 interrupt will not trigger
    if (c0_match == 0)
        c0_match = 1;
#endif
    Cy_MCWDT_SetMatch(obj->base, CY_MCWDT_COUNTER0, c0_match, _CYHAL_LPTIMER_SETMATCH_TIME_US);
    Cy_MCWDT_SetMatch(obj->base, CY_MCWDT_COUNTER1, c1_match, _CYHAL_LPTIMER_SETMATCH_TIME_US);
    cyhal_system_critical_section_exit(critical_section);
    #if defined(CY_IP_MXS40SRSS) || defined(CY_IP_MXS40SSRSS) || defined(CY_IP_MXS28SRSS)
    Cy_MCWDT_SetInterruptMask(obj->base, CY_MCWDT_CTR1);
    #else
    Cy_WDC_InterruptEnable(obj->base, CY_MCWDT_COUNTER1);
    #endif
    return CY_RSLT_SUCCESS;
}
#endif

cy_rslt_t cyhal_lptimer_init(cyhal_lptimer_t *obj)
{
    CY_ASSERT(NULL != obj);

    obj->resource.type = CYHAL_RSC_INVALID;
    obj->clear_int_mask = false;
    obj->isr_call_user_cb = false;

    cy_rslt_t rslt = cyhal_hwmgr_allocate(CYHAL_RSC_LPTIMER, &(obj->resource));
    if (CY_RSLT_SUCCESS == rslt)
    {
        obj->base = _CYHAL_LPTIMER_BASE_ADDRESSES[obj->resource.block_num];
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
        obj->offset = 0;
        obj->final_time = 0;
        obj->counter = CY_MCWDT_CTR1;
        cy_stc_mcwdt_b_config_t cfg = default_cfg;
#elif defined(CY_IP_MXS40SRSS_MCWDT) || defined(CY_IP_MXS40SSRSS) || defined(CY_IP_MXS28SRSS)
        cy_stc_mcwdt_config_t cfg = default_cfg;
#elif defined (CY_IP_M0S8WCO)
        cy_stc_wdc_config_t cfg = default_cfg;
        // The WDC_SEL clock source is populated into the config
        // register by the clock driver. Extract it so that the
        // PDL init doesn't revert it to default
        cfg.clockSource = Cy_WDC_GetClockSource(WCO);
#endif
        rslt = (cy_rslt_t) Cy_MCWDT_Init(obj->base, &cfg);
    }

    if (CY_RSLT_SUCCESS == rslt)
    {
        obj->callback_data.callback = NULL;
        obj->callback_data.callback_arg = NULL;
        _cyhal_lptimer_config_structs[obj->resource.block_num] = obj;
    }

    if (CY_RSLT_SUCCESS == rslt)
    {
        _cyhal_system_irq_t irqn = (_cyhal_system_irq_t) (srss_interrupt_mcwdt_0_IRQn + obj->resource.block_num);
        _cyhal_irq_register(irqn, _CYHAL_LPTIMER_DEFAULT_PRIORITY, _cyhal_lptimer_irq_handler);

        if (CY_RSLT_SUCCESS == rslt)
        {
            _cyhal_irq_enable(irqn);
        #if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
            Cy_MCWDT_Unlock(obj->base);
            Cy_MCWDT_Enable(obj->base, (CY_MCWDT_CTR1 | CY_MCWDT_CTR2), _CYHAL_LPTIMER_RESET_TIME_US);
            Cy_MCWDT_Lock(obj->base);
        #else
            Cy_MCWDT_Enable(obj->base, _CYHAL_LPTIMER_CTRL, _CYHAL_LPTIMER_RESET_TIME_US);
        #endif
        }
    }

    if (CY_RSLT_SUCCESS != rslt)
    {
        cyhal_lptimer_free(obj);
    }

    return rslt;
}

void cyhal_lptimer_free(cyhal_lptimer_t *obj)
{
    if (CYHAL_RSC_INVALID != obj->resource.type)
    {
        _cyhal_system_irq_t irqn = (_cyhal_system_irq_t)(srss_interrupt_mcwdt_0_IRQn + obj->resource.block_num);
        _cyhal_irq_free(irqn);

        cyhal_hwmgr_free(&(obj->resource));
        obj->resource.type = CYHAL_RSC_INVALID;
    }
    if (NULL != obj->base)
    {
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
        Cy_MCWDT_Unlock(obj->base);
        // only need to disable counter1 and counter2 since those are the only counters
        // used for the IP.
        Cy_MCWDT_Disable(obj->base, (CY_MCWDT_CTR1 | CY_MCWDT_CTR2), _CYHAL_LPTIMER_RESET_TIME_US);
        Cy_MCWDT_Lock(obj->base);
#else
        Cy_MCWDT_Disable(obj->base, _CYHAL_LPTIMER_CTRL, _CYHAL_LPTIMER_RESET_TIME_US);
#endif
        // When we're using the WDC, the clock source selection is stored in the WDC_CONFIG
        // register and we want that to persist across free/init calls. So don't call deinit
        // because that will clear it out.
#if !defined(CY_IP_M0S8WCO)
        Cy_MCWDT_DeInit(obj->base);
#endif
        obj->base = NULL;
    }
}

cy_rslt_t cyhal_lptimer_reload(cyhal_lptimer_t *obj)
{
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
    // we save the current value for counter2 as our offset.
    // This is done because for CAT1C devices we cannot reset counter2.
    // This gives us the ability to mimic a reset by keeping track of
    // the last time reload was called. The offset will be deducted
    // from the current counter2 value when cyhal_lptimer_read is called
    obj->offset = Cy_MCWDT_GetCount(obj->base, CY_MCWDT_CTR2);
    Cy_MCWDT_Unlock(obj->base);
    Cy_MCWDT_ResetCounters(obj->base, CY_MCWDT_CTR1, _CYHAL_LPTIMER_RESET_TIME_US);
    Cy_MCWDT_Lock(obj->base);

#else
    Cy_MCWDT_ResetCounters(obj->base, (CY_MCWDT_CTR0 | CY_MCWDT_CTR1 | CY_MCWDT_CTR2), 2 * _CYHAL_LPTIMER_RESET_TIME_US);
#endif
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_lptimer_set_match(cyhal_lptimer_t *obj, uint32_t ticks)
{
    obj->clear_int_mask = false;
    uint32_t c2_current = cyhal_lptimer_read(obj);
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
    // The reason we add the offset to ticks is because we want to get
    // the current value of counter2 without the offset value.
    // Since our delay is ticks - c2_current, this will get us our
    // current time + delay
    obj->final_time = ticks + obj->offset;
#endif
    return _cyhal_lptimer_set_delay_common(obj, ticks - c2_current);
}

cy_rslt_t cyhal_lptimer_set_delay(cyhal_lptimer_t *obj, uint32_t delay)
{
    obj->clear_int_mask = true;
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
    obj->final_time = (Cy_MCWDT_GetCount(obj->base, CY_MCWDT_CTR2) + delay);
#endif
    return _cyhal_lptimer_set_delay_common(obj, delay);
}

uint32_t cyhal_lptimer_read(const cyhal_lptimer_t *obj)
{
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
    uint32_t ctr2_count = Cy_MCWDT_GetCount(obj->base, CY_MCWDT_CTR2);
    if(obj->offset > ctr2_count)
    {
        return (uint32_t)((((uint64_t)1 << 32) - obj->offset) + ctr2_count);
    }
    else
    {
        return ctr2_count - obj->offset;
    }
#else
    return Cy_MCWDT_GetCount(obj->base, CY_MCWDT_COUNTER2);
#endif
}

void cyhal_lptimer_register_callback(cyhal_lptimer_t *obj, cyhal_lptimer_event_callback_t callback, void *callback_arg)
{
    CY_ASSERT(CYHAL_RSC_INVALID != obj->resource.block_num);

    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->callback_data.callback = (cy_israddress) callback;
    obj->callback_data.callback_arg = callback_arg;
    cyhal_system_critical_section_exit(savedIntrStatus);
}

void cyhal_lptimer_enable_event(cyhal_lptimer_t *obj, cyhal_lptimer_event_t event, uint8_t intr_priority, bool enable)
{
    CY_UNUSED_PARAMETER(event);
    CY_ASSERT(event == CYHAL_LPTIMER_COMPARE_MATCH);

