RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_lptimer.c
    _cyhal_system_irq_t irqn = (_cyhal_system_irq_t)(srss_interrupt_mcwdt_0_IRQn + obj->resource.block_num);
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
    Cy_MCWDT_ClearInterrupt(obj->base, obj->counter);
#else
    Cy_MCWDT_ClearInterrupt(obj->base, CY_MCWDT_CTR1);
#endif
    _cyhal_irq_set_priority(irqn, intr_priority);

    obj->isr_call_user_cb = enable;
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
    (enable) ? Cy_MCWDT_SetInterruptMask(obj->base, obj->counter) : Cy_MCWDT_ClearInterruptMask(obj->base, obj->counter);
#elif defined(CY_IP_MXS40SRSS_MCWDT) || defined(CY_IP_MXS40SSRSS) || defined(CY_IP_MXS28SRSS)
    Cy_MCWDT_SetInterruptMask(obj->base, enable ? CY_MCWDT_CTR1: 0);
#elif defined (CY_IP_M0S8WCO)
    (enable) ? _cyhal_irq_enable(irqn) : _cyhal_irq_disable(irqn);
#endif
}

void cyhal_lptimer_irq_trigger(cyhal_lptimer_t *obj)
{
    CY_ASSERT(CYHAL_RSC_INVALID != obj->resource.block_num);
    cyhal_lptimer_event_callback_t callback = (cyhal_lptimer_event_callback_t) obj->callback_data.callback;
    (callback)(obj->callback_data.callback_arg, CYHAL_LPTIMER_COMPARE_MATCH);
}

void cyhal_lptimer_get_info(cyhal_lptimer_t *obj, cyhal_lptimer_info_t *info)
{
    CY_UNUSED_PARAMETER(obj);
    CY_ASSERT(info != NULL);

#if (WCO_WDT_EN == 1)
    const cyhal_clock_t *lf_obj = &CYHAL_CLOCK_WDCSEL;
#else
    const cyhal_clock_t *lf_obj = &CYHAL_CLOCK_LF;
#endif
    info->frequency_hz = cyhal_clock_get_frequency(lf_obj);
    info->min_set_delay = _CYHAL_LPTIMER_MIN_DELAY;
    info->max_counter_value = _CYHAL_LPTIMER_MAX_COUNTER_VAL;
}

#if defined(__cplusplus)
}
#endif

#endif // CYHAL_DRIVER_AVAILABLE_LPTIMER
